<!DOCTYPE HTML> <!--TODO fix1-->
<html>
<head>
    <title>Типы заданий</title> <!--TODO fix2-->
    <meta charset="utf-8">

    <!--CEO-->

    <link href="../css/reset.css" rel="stylesheet">
    <link href="../css/index.css" rel="stylesheet">
    <!-- <script src="jquery-2.1.4.min.js"></script>-->
    <!--<script src="index.js"></script>-->
</head>
<body>
<?php include("../blocks/header.php"); ?>
<?php include("../blocks/nav.php"); ?>
<?php include("../blocks/leftMenu.php"); ?>
<main>
    <table>
        <caption>Задания части А</caption>
        <tr>
            <th>Номер задания</th>
            <th>Краткое описание</th>
        </tr>
        <tr>
            <td>A-1</td>
            <td>Знания о системах счисления и двоичном представлении информации в памяти компьютера</td>
        </tr>
        <tr>
            <td>A-2</td>
            <td>Умение представлять и считывать данные в разных типах информационных моделей</td>
        </tr>
        <tr>
            <td>A-3</td>
            <td>Умения строить таблицы истинности и логические схемы</td>
        </tr>
        <tr>
            <td>A-4</td>
            <td>Знания о файловой системе организации данных</td>
        </tr>
        <tr>
            <td>A-5</td>
            <td>Формальное исполнение алгоритма, записанного на естественном языке</td>
        </tr>
        <tr>
            <td>A-6</td>
            <td>Знание технологии хранения, поиска и сортировки информации в базах данных</td>
        </tr>
        <tr>
            <td>A-7</td>
            <td>Знание технологии обработки информации в электронных таблицах</td>
        </tr>
        <tr>
            <td>A-8</td>
            <td>Знание технологии обработки звука</td>
        </tr>
        <tr>
            <td>A-9</td>
            <td>Умение кодировать и декодировать информацию</td>
        </tr>
        <tr>
            <td>A-10</td>
            <td>Знание основных понятий и законов математической логики</td>
        </tr>
        <tr>
            <td>A-11</td>
            <td>Умение подсчитывать информационный объем сообщения</td>
        </tr>
        <tr>
            <td>A-12</td>
            <td>Работа с массивами</td>
        </tr>
        <tr>
            <td>A-13</td>
            <td>Умение исполнить алгоритм для конкретного исполнителя с фиксированным набором команд</td>
        </tr>
    </table>

    <table>
        <caption>Задания части B</caption>
        <tr>
            <th>Номер задания</th>
            <th>Краткое описание</th>
        </tr>
        <tr>
            <td>B-1</td>
            <td>Умение создавать линейный алгоритм для формального исполнителя</td>
        </tr>
        <tr>
            <td>B-2</td>
            <td>Использование переменных. Операции над переменными различных типов в языке программирования.</td>
        </tr>
        <tr>
            <td>B-3</td>
            <td>Знания о визуализации данных с помощью диаграмм и графиков</td>
        </tr>
        <tr>
            <td>B-4</td>
            <td>Знания о методах измерения количества информации</td>
        </tr>
        <tr>
            <td>B-5</td>
            <td>Знание основных конструкций языка программирования</td>
        </tr>
        <tr>
            <td>B-6</td>
            <td>Умение исполнить рекурсивный алгоритм</td>
        </tr>
        <tr>
            <td>B-7</td>
            <td>Знание позиционных систем счисления</td>
        </tr>
        <tr>
            <td>B-8</td>
            <td>Анализ алгоритма, содержащего вспомогательные алгоритмы, цикл и ветвление</td>
        </tr>
        <tr>
            <td>B-9</td>
            <td>Умение представлять и считывать данные в разных типах информационных моделей</td>
        </tr>
        <tr>
            <td>B-10</td>
            <td>Умение определять скорость передачи информации при заданной пропускной способности канала</td>
        </tr>
        <tr>
            <td>B-11</td>
            <td>Знание базовых принципов организации и функционирования компьютерных сетей, адресации в сети</td>
        </tr>
        <tr>
            <td>B-12</td>
            <td>Умение осуществлять поиск информации в Интернет</td>
        </tr>
        <tr>
            <td>B-13</td>
            <td>Умение анализировать результат исполнения алгоритма</td>
        </tr>
        <tr>
            <td>B-14</td>
            <td>Умение анализировать программу, использующую процедуры и функции</td>
        </tr>
        <tr>
            <td>B-15</td>
            <td>Умение строить и преобразовывать логические выражения</td>
        </tr>
    </table>
</main>
<?php include("../blocks/rightMenu.php"); ?>
<?php include("../blocks/footer.php"); ?>
</body>
</html>
